conf/src/InformationRegisters/ЭП_КоманднаяРаботаПоПроекту/ЭП_КоманднаяРаботаПоПроекту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_КоманднаяРаботаПоПроекту</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодОценивания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_ДатыЗакрытияРедактированияПроектныхПоказателей/ЭП_ДатыЗакрытияРедактированияПроектныхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ДатыЗакрытияРедактированияПроектныхПоказателей</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_КоманднаяРаботаПоПроекту/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	ТекПоказатели = ЭтотОбъект.ВыгрузитьКолонку("Показатель");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭП_ДатыЗакрытияРедактированияПроектныхПоказателейСрезПоследних.Период КАК Период,
	               |	ЭП_ДатыЗакрытияРедактированияПроектныхПоказателейСрезПоследних.Показатель КАК Показатель
	               |ИЗ
	               |	РегистрСведений.ЭП_ДатыЗакрытияРедактированияПроектныхПоказателей.СрезПоследних(&Период, Показатель В (&МассивПоказателей)) КАК ЭП_ДатыЗакрытияРедактированияПроектныхПоказателейСрезПоследних
	               |ГДЕ
	               |	ЭП_ДатыЗакрытияРедактированияПроектныхПоказателейСрезПоследних.Период = &Период";
	Запрос.УстановитьПараметр("МассивПоказателей", ТекПоказатели); 
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Отбор.ПериодОценивания.Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
			
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "По следующим проектным показателям закрыт период редактирования: ";        
		Сообщение.Сообщить();
		Пока Выборка.Следующий() Цикл
		
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ""+Выборка.Показатель;        
			Сообщение.Сообщить();
		
		КонецЦикла;
		Возврат;
	
	КонецЕсли;
	
КонецПроцедуры
